{"config": [{"config": {"bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv1", "filters": 3, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "padding": "same", "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_size": [6, 6], "data_format": "channels_last", "dtype": "float32", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2", "filters": 6, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv3", "filters": 6, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_size": [4, 4], "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flat1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "name": "dense1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "drop1", "rate": 0.75}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "name": "output", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 43, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.1", "class_name": "Sequential"}