{"keras_version": "1.2.1", "config": [{"config": {"activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "name": "conv1", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "batch_input_shape": [null, 32, 32, 3], "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 32, "activity_regularizer": null, "border_mode": "same", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "name": "drop1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "init": "glorot_uniform", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "conv2", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "W_regularizer": null, "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "pool1", "trainable": true, "dim_ordering": "th", "border_mode": "valid", "pool_size": [1, 1], "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "name": "drop2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flat1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "init": "glorot_uniform", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "dense1", "trainable": true, "input_dim": 6144, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 512, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "drop3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "init": "glorot_uniform", "W_constraint": null, "name": "output", "trainable": true, "input_dim": 512, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 43, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}