{"keras_version": "2.0.1", "config": [{"config": {"activity_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "name": "conv1"}, "class_name": "Conv2D"}, {"config": {"pool_size": [1, 1], "trainable": true, "data_format": "channels_first", "strides": [1, 1], "name": "pool1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "drop2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flat1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 32768], "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "units": 512, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense1"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "drop3"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "units": 43, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "output"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}