{"config": [{"config": {"bias_constraint": null, "name": "conv1", "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 3, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "name": "conv2", "padding": "same", "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 6, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "name": "conv3", "padding": "same", "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 6, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flat1"}, "class_name": "Flatten"}, {"config": {"name": "dense1", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "drop1", "rate": 0.75}, "class_name": "Dropout"}, {"config": {"name": "output", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 43}, "class_name": "Dense"}], "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential"}